Series

In [4]:
import pandas as pd

In [6]:
pd.Series(10)

0    10
dtype: int64

In [ ]:
시리즈: 컬럼 + 인덱스 형식으로 저장, 관리, 리스트/배열과 유사한 형태
* 컬럼들: 1차원 데이터의 모음 - 1개 컬럼
* 컬럼들 > 데이터 프레임

데이터 프레임: 컬럼들 + 인덱스, 엑셀 표(테이블) 유사한 형태

In [7]:
s1 = pd.Series([10,20,30])
s1
# s1[0:2]

0    10
1    20
2    30
dtype: int64

In [8]:
s1 = pd.Series([10,20,30]) #리스트로 묶어야하는 이유가 뭔지??
s1[0:2] #리스트로 묶어야하는 이유가 뭔지??

0    10
1    20
dtype: int64

In [9]:
col_idx = ['A','B','C']
data = [10,20,30]
s2 = pd.Series(data, index=col_idx)
s2 #판다스 데이터타입 dtype

A    10
B    20
C    30
dtype: int64

In [ ]:
s2[0] >> 인덱싱 표식

C:\Users\Admin\AppData\Local\Temp\ipykernel_16236\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

np.int64(10)

In [12]:
s2['A':'C'] #index 0부터 끝(-1)>순서기반인덱스

A    10
B    20
C    30
dtype: int64

In [13]:
s2

A    10
B    20
C    30
dtype: int64

In [14]:
dict_data = {'A': 10, 'B': 20, 'C': 30} #딕셔너리 키 = 시리즈 인덱스
type(dict_data)
s3 = pd.Series(dict_data)

In [15]:
s3.info() #객체의 메소드

<class 'pandas.core.series.Series'>
Index: 3 entries, A to C
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 48.0+ bytes

In [16]:
population = pd.Series([9776, 2729, 1566, 3158], 
index=['서울', '부산', '인천', '대구'])
population

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [17]:
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [18]:
population[['대구']]

대구    3158
dtype: int64

In [19]:
population['제주'] = 30

In [20]:
population

서울    9776
부산    2729
인천    1566
대구    3158
제주      30
dtype: int64

In [21]:
import numpy as np

# 데이터 프레임 DataFrame

In [22]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [24]:
pd.DataFrame(data, columns=['A','B','C'], index=['홍길동','김길동','박길동']) #columns가 3개인데 2개만 설정하는 경우 오류남

     A  B  C
홍길동  1  2  3
김길동  4  5  6
박길동  7  8  9

In [25]:
# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [ ]:
# 2차원 넘파이 어레이 생성
pd.DataFrame(arr, columns=['A','B','C'], index=['홍길동','김길동','박길동'])

     A  B  C
홍길동  1  2  3
김길동  4  5  6
박길동  7  8  9

In [28]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])
names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [35]:
# pd.DataFrame([names, ages, scores]) 행으로 인식함
pd.DataFrame({
  'name': names,
  'age': ages,
  'score':scores
})

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78

In [36]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = pd.DataFrame(data)

In [50]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [51]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G'] #replace
print(df.index)

# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age','score']

# 열 순서는 그대로 유지되며, 새로운 이름이 순서대로 적용됨
print(df.columns)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

In [47]:
df.rename(columns={'name': '이름'}, inplace=True) #before:after

In [52]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [54]:
df1 = df.rename(columns={'name':'이름'})

In [55]:
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [57]:
# 미리보기
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 524.0+ bytes

In [ ]:
df.head(3) #default 5개

In [58]:
df.tail(3)

  name  age  score
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [59]:
df.describe()

             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

#인덱싱

[] 인덱싱

- iloc[] 행기반 인덱싱 >>> [행,열]
- loc[] 이름기반(위치) 인덱싱 >>> [행이름,열이름]

- : >>> start:end까지 슬라이싱
- loc[행이름:행이름]
- iloc[행번호:행번호] >>> end 행번호는 -1까지

In [72]:
# df1[['이름','age']]
df1.loc[ : , ['이름','age']] #loc [행,열]

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29

In [73]:
df1.iloc[0:3, 0:2] #행번호, 열

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22

연습문제
[기본]

모든 행에서 이름 열만 선택하세요.

모든 행에서 이름과 score 열을 선택하세요.

인덱스 C 행의 모든 데이터를 선택하세요.

인덱스 D 행의 age 값만 선택하세요.

In [75]:
df1[['이름']]

    이름
A  김철수
B  이영희
C  박민수
D  정수진
E  최영호
F  한미래
G  윤지원

In [76]:
df1[['이름','score']]

    이름  score
A  김철수     85
B  이영희     92
C  박민수     78
D  정수진     95
E  최영호     88
F  한미래     73
G  윤지원     91

In [80]:
df1.loc[['C']]

    이름  age  score
C  박민수   22     78

In [96]:
df1[['age']]

   age
A   25
B   28
C   22
D   31
E   27
F   24
G   29

[슬라이싱]

인덱스 B부터 E까지의 모든 행을 선택하세요.

인덱스 C부터 F까지의 이름과 age 열만 선택하세요.

인덱스 A부터 G까지에서 score 열만 선택하세요.

# Boolean 인덱싱

In [ ]:
df[ df ['score'] > 90 ] #vectorization boolean list의 요소값 True, False

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [105]:
cond = df1['age'] >= 27

In [107]:
# [조건 + loc]

# age가 27 이상인 행만 선택하세요.
df1.loc[cond]

# score가 90 이상인 사람의 이름과 score만 출력하세요.
df1.loc[ df1['score'] >= 90, ['이름','score']]

# age가 25 이상이면서 score가 90 이상인 행을 모두 선택하세요.
cond1 = df['age'] >= 25
cond2 = df1['score'] >= 90
df1.loc[cond1 & cond2]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [109]:
# [기본]

# 첫 번째 행의 모든 데이터를 선택하세요.

# 세 번째 행의 이름 값만 선택하세요.

# 처음 3개의 행을 선택하세요.

# 마지막 행의 score 값만 선택하세요.
df1.iloc[-1,2]

np.int64(91)

In [113]:
# [슬라이싱]

# 1번 행부터 4번 행까지 선택하세요.
df1.iloc[1:5]

# 2번 행부터 5번 행까지에서 이름과 age 열만 선택하세요.
df1.iloc[1:6, :2]

# 모든 행에서 age 열만 선택하세요.
df1.iloc[:,1]

A    25
B    28
C    22
D    31
E    27
F    24
G    29
Name: age, dtype: int64

In [ ]:
# [조합 문제]

# score 열만 선택하되, 앞에서 4개의 행만 출력하세요.
df1.iloc[ :4, 2 ]

# 이름과 score 열을 선택하되, 마지막 3개의 행만 출력하세요.
df1.iloc[-3:, [0, 2]] #start:end:step
df1.tail(3).iloc[:, [0, 2]]


# 짝수 번째 행(0, 2, 4, 6)의 모든 데이터를 선택하세요.

    이름  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [ ]:
df